modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN3</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x4000e800</baseAddress>
      <interrupt>
        <name>FDCAN3_IT0</name>
        <description>FDCAN3 interrupt 0</description>
        <value>184</value>
      </interrupt>
      <interrupt>
        <name>FDCAN3_IT1</name>
        <description>FDCAN3 interrupt 1</description>
        <value>185</value>
      </interrupt>
      <interrupt>
        <name>FDCAN_CU</name>
        <description>FDCAN Clock Unit interrupt</description>
        <value>186</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>UCPD1</name>
      <description>UCPD</description>
      <groupName>UCPD</groupName>
      <baseAddress>0x4000fc00</baseAddress>
      <interrupt>
        <name>UCPD1</name>
        <description>UCPD1 global interrupt</description>
        <value>176</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG1</name>
          <description>UCPD configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HBITCLKDIV</name>
              <description>Number of cycles (minus 1) for a half bit clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IFRGAP</name>
              <description>Clock divider value to generates Interframe gap</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRANSWIN</name>
              <description>Number of cycles (minus 1) of the half bit clock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PSC_UCPDCLK</name>
              <description>Prescaler for UCPDCLK</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Bypass pre-scaling / divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Pre-scale clock by dividing by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Pre-scale clock by dividing by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Pre-scale clock by dividing by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Pre-scale clock by dividing by 16</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXORDSETEN</name>
              <description>Receiver ordered set detection enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOP</name>
                  <description>SOP Ordered set detection enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1</name>
                  <description>SOP' Ordered set detection enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2</name>
                  <description>SOP'' Ordered set detection enabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDRST</name>
                  <description>Hard Reset Ordered set detection enabled</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CABLERST</name>
                  <description>Cable Reset Ordered set detection enabled</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1_DEBUG</name>
                  <description>SOP' Debug Ordered set detection enabled</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2_DEBUG</name>
                  <description>SOP'' Debug Ordered set detection enabled</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP_EXT1</name>
                  <description>SOP extension#1 Ordered set detection enabled</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP_EXT2</name>
                  <description>SOP extension#2 Ordered set detection enabled</description>
                  <value>256</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>DMA transmission requests enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>DMA reception requests enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UCPDEN</name>
              <description>USB Power Delivery Block Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>UCPD configuration register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXFILTDIS</name>
              <description>Enables an Rx pre-filter for the BMC decoder</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFILT2N3</name>
              <description>Controls the sampling method for an Rx pre-filter for the BMC decode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCECLK</name>
              <description>Controls forcing of the clock request UCPDCLK_REQ</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN</name>
              <description>Wakeup from STOP enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXAFILTEN</name>
              <description>Rx analog filter enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>UCPD control register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXMODE</name>
              <description>Type of Tx packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Initiate the transfer of a Tx message</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CABLE_RESET</name>
                  <description>Trigger a the transfer of a Cable Reset sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIST_CARRIER2</name>
                  <description>Trigger a BIST test sequence send (BIST Carrier Mode 2)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSEND</name>
              <description>Type of Tx packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXHRST</name>
              <description>Command to send a Tx Hard Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXMODE</name>
              <description>Receiver mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal receive mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIST_TEST_DATA</name>
                  <description>BIST receive mode (BIST Test Data Mode)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYRXEN</name>
              <description>Controls enable of USB Power Delivery receiver</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHYCCSEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Use CC1 IO for power delivery communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Use CC2 IO for power delivery communication</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANASUBMODE</name>
              <description>Analog PHY sub-mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Rp default</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESISTOR_1_5A</name>
                  <description>Rp 1.5 A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESISTOR_3_0A</name>
                  <description>Rp 3.0 A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No resistor</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAMODE</name>
              <description>Analog PHY working mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SNK</name>
                  <description>Mode SNK Rd</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC</name>
                  <description>Mode SRC Rp</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCENABLE</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Neither PHY is activated (e.g. disabled state of source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Controls apply to only CC1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Controls apply to only CC1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1CC2</name>
                  <description>Controls apply to both CC1 and CC2 (normal usage for sink/source)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEEXTPHY</name>
              <description>Controls enable of USB Power Delivery transmitter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2VCONNEN</name>
              <description>VCONN enable for CC2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1VCONNEN</name>
              <description>VCONN enable for CC1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBATEN</name>
              <description>Enable dead battery behavior (Active High)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSTX</name>
              <description>Signal Fast Role Swap request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDCH</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPUSBABSENT</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1TCDIS</name>
              <description>The bit allows the Type-C detector for CC0 to be disabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2TCDIS</name>
              <description>The bit allows the Type-C detector for CC2 to be disabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>UCPD interrupt mask register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXISIE</name>
              <description>Enable TXIS interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGDISCIE</name>
              <description>Enable TXMSGDISC interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGSENTIE</name>
              <description>Enable TXMSGSENT interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGABTIE</name>
              <description>Enable TXMSGABT interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTDISCIE</name>
              <description>Enable HRSTDISC interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTSENTIE</name>
              <description>Enable HRSTSENT interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDIE</name>
              <description>Enable TXUND interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>Enable RXNE interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXORDDETIE</name>
              <description>Enable RXORDDET interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXHRSTDETIE</name>
              <description>Enable RXHRSTDET interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVRIE</name>
              <description>Enable RXOVR interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXMSGENDIE</name>
              <description>Enable RXMSGEND interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT1IE</name>
              <description>Enable TYPECEVT1IE interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT2IE</name>
              <description>Enable TYPECEVT2IE interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>UCPD status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXIS</name>
              <description>Transmit interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGDISC</name>
              <description>Transmit message discarded interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGSENT</name>
              <description>Transmit message sent interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGABT</name>
              <description>Transmit message abort interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTDISC</name>
              <description>HRST discarded interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTSENT</name>
              <description>HRST sent interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUND</name>
              <description>Tx data underrun condition interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNE</name>
              <description>Receive data register not empty interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXORDDET</name>
              <description>Rx ordered set (4 K-codes) detected interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXHRSTDET</name>
              <description>Rx Hard Reset detect interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVR</name>
              <description>Rx data overflow interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXMSGEND</name>
              <description>Rx message received</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXERR</name>
              <description>RX Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT1</name>
              <description>Type C voltage level event on CC1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT2</name>
              <description>Type C voltage level event on CC2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPEC_VSTATE_CC1</name>
              <description>Status of DC level on CC1 pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TYPEC_VSTATE_CC2</name>
              <description>Status of DC level on CC2 pin</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
