modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>AHB5FZ1</name>
          <description>Debug MCU AHB5FZ1 freeze register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBG_HPDMA1_CH0_STOP</name>
              <description>HPDMA1_CH0 suspend in debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH1_STOP</name>
              <description>HPDMA1_CH1 suspend in debug</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH2_STOP</name>
              <description>HPDMA1_CH2 suspend in debug</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH3_STOP</name>
              <description>HPDMA1_CH3 suspend in debug</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH4_STOP</name>
              <description>HPDMA1_CH4 suspend in debug</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH5_STOP</name>
              <description>HPDMA1_CH5 suspend in debug</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH6_STOP</name>
              <description>HPDMA1_CH6 suspend in debug</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH7_STOP</name>
              <description>HPDMA1_CH7 suspend in debug</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH8_STOP</name>
              <description>HPDMA1_CH8 suspend in debug</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH9_STOP</name>
              <description>HPDMA1_CH9 suspend in debug</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH10_STOP</name>
              <description>HPDMA1_CH10 suspend in debug</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH11_STOP</name>
              <description>HPDMA1_CH11 suspend in debug</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH12_STOP</name>
              <description>HPDMA1_CH12 suspend in debug</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH13_STOP</name>
              <description>HPDMA1_CH13 suspend in debug</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH14_STOP</name>
              <description>HPDMA1_CH14 suspend in debug</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_HPDMA1_CH15_STOP</name>
              <description>HPDMA1_CH15 suspend in debug</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Debug MCU status register</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AP0_PRESENT</name>
              <description>Access point 0 presence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AP1_PRESENT</name>
              <description>Access point 1 presence</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AP0_ENABLE</name>
              <description>Access point 0 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AP1_ENABLE</name>
              <description>Access point 1 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_HOST</name>
          <description>Debug MCU authentication host register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESSAGE</name>
              <description>Message[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_DEV</name>
          <description>Debug MCU authentication device register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESSAGE</name>
              <description>Message[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_AUTH_ACK</name>
          <description>Debug MCU acknowledge authentication register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HOST_ACK</name>
              <description>Access status to DBG_AUTH_HOST register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEVICE_ACK</name>
              <description>Access status to DBG_AUTH_DEV register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
