modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYP</name>
      <description>Cryp Processor</description>
      <groupName>CRYP</groupName>
      <baseAddress>0x44020800</baseAddress>
      <interrupt>
        <name>CRYP</name>
        <description>CRYP interrupt</description>
        <value>37</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>CRYP control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALGODIR</name>
              <description>Algorithm direction (Encrypt/Decrypt)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALGOMODE</name>
              <description>Algorithm mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DATATYPE</name>
              <description>Data Type selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Key Size selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>CRYP FIFO Flush</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYPEN</name>
              <description>CRYP processor enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCM_CCMPH</name>
              <description>GCM or CCM Phase selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ALGOMODE_3</name>
              <description>Algorithm mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NPBLB</name>
              <description>Number of Padding Bytes in Last Block of payload</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KMOD</name>
              <description>Key mode selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IPRST</name>
              <description>CRYP peripheral software reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>CRYP status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IFEM</name>
              <description>Input FIFO empty flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFNF</name>
              <description>Input FIFO not full flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFNE</name>
              <description>Output FIFO not empty flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFU</name>
              <description>Output FIFO full flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KERF</name>
              <description>Key error flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEYVALID</name>
              <description>Key valid flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN</name>
          <description>CRYP data input register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATAIN</name>
              <description>CRYP Data Input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT</name>
          <description>CRYP data output register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATAOUT</name>
              <description>CRYP Data Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACR</name>
          <description>CRYP DMA control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIEN</name>
              <description>DMA Input Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOEN</name>
              <description>DMA Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMSCR</name>
          <description>CRYP interrupt mask set/clear register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIM</name>
              <description>Input FIFO service interrupt mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTIM</name>
              <description>Output FIFO service interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RISR</name>
          <description>CRYP raw interrupt status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INRIS</name>
              <description>Input FIFO service raw interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTRIS</name>
              <description>Output FIFO service raw interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <description>CRYP masked interrupt status register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INMIS</name>
              <description>Input FIFO service masked interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTMIS</name>
              <description>Output FIFO service masked interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K0LR</name>
          <description>CRYP key left register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 224 to 255)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K0RR</name>
          <description>CRYP key right register 0</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 192 to 223)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K1LR</name>
          <description>CRYP key left register 1</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>K1RR</name>
          <description>CRYP key right register 1</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>K2LR</name>
          <description>CRYP key left register 2</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 96 to 127)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K2RR</name>
          <description>CRYP key right register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 64 to 95)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K3LR</name>
          <description>CRYP key left register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 32 to 63)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K3RR</name>
          <description>CRYP key right register 3</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0LR</name>
          <description>CRYP initialization vector left-word register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IV</name>
              <description>Initialization vector bit x (x= 0 to 31)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0RR</name>
          <description>CRYP initialization vector right-word register 0</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IV</name>
              <description>Initialization vector bit x (x= 32 to 63)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1LR</name>
          <description>CRYP initialization vector left-word register 1</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 160 to 291)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1RR</name>
          <description>CRYP initialization vector right-word register 1</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>K</name>
              <description>AES key bit x (x= 128 to 159)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM0R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM0</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM1R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM1</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM2R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 2</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM2</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM3R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 3</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM3</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM4R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 4</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM4</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM5R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 5</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM5</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM6R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 6</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM6</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCMCCM7R</name>
          <description>CRYP GCM/GMAC or CCM/CMAC context swap register 7</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCMCCM7</name>
              <description>CRYP internal state registers for GCM, GMAC and CCM modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM0R</name>
          <description>CRYP GCM/GMAC context swap register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM0</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM1R</name>
          <description>CRYP GCM/GMAC context swap register 1</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM1</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM2R</name>
          <description>CRYP GCM/GMAC context swap register 2</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM2</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM3R</name>
          <description>CRYP GCM/GMAC context swap register 3</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM3</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM4R</name>
          <description>CRYP GCM/GMAC context swap register 4</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM4</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM5R</name>
          <description>CRYP GCM/GMAC context swap register 5</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM5</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM6R</name>
          <description>CRYP GCM/GMAC context swap register 6</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM6</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSGCM7R</name>
          <description>CRYP GCM/GMAC context swap register 7</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSGCM7</name>
              <description>CRYP internal state registers for GCM and GMAC modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
