modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>FVRw288</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw289</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw290</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw291</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x48c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw292</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw293</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw294</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw295</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x49c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw296</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw297</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw298</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw299</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw300</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw301</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw302</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw303</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw304</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw305</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw306</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw307</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw308</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw309</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw310</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw311</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw312</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw313</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw314</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw315</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw316</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw317</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw318</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw319</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x4fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw320</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw321</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw322</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw323</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x50c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw324</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw325</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw326</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw327</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x51c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw328</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw329</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw330</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw331</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x52c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw332</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw333</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw334</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw335</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x53c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
