modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>OTPSR</name>
          <description>BSEC OTP status register</description>
          <addressOffset>0xe44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT_DONE</name>
              <description>Initialization done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIDEUP</name>
              <description>Hide upper fuse words</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPNVIR</name>
              <description>OTP not virgin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPERR</name>
              <description>OTP with error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTPSEC</name>
              <description>OTP with single error correction</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROGFAIL</name>
              <description>Programming failed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISTURBF</name>
              <description>Disturb flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>Double error detection flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECF</name>
              <description>Single error correction flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPLF</name>
              <description>Permanent programming lock flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPLMF</name>
              <description>Permanent programming lock mismatch flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMEF</name>
              <description>Addresses mismatch error flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHR0</name>
          <description>BSEC epoch register (0-1)</description>
          <addressOffset>0xe80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHR1</name>
          <description>BSEC epoch register (0-1)</description>
          <addressOffset>0xe84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHSELR</name>
          <description>BSEC epoch select register</description>
          <addressOffset>0xe88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPSEL</name>
              <description>Epoch selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCR</name>
          <description>BSEC debug control register</description>
          <addressOffset>0xe8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>Non-secure debug authorization</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AUTH_HDPL</name>
              <description>Level at which debug may be opened</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AUTH_SEC</name>
              <description>Secure debug authorization</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AP_UNLOCK</name>
          <description>BSEC AP unlock</description>
          <addressOffset>0xe90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>Unlock DBG_MCU AP interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLSR</name>
          <description>BSEC hide protection level status register</description>
          <addressOffset>0xe94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HDPL</name>
              <description>Current HDPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLCR</name>
          <description>BSEC hide protection level control register</description>
          <addressOffset>0xe98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INCR_HDPL</name>
              <description>Increment HDPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NEXTLR</name>
          <description>BSEC next hide protection level register</description>
          <addressOffset>0xe9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INCR</name>
              <description>Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR0</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR1</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR2</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR3</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR4</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR5</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR6</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WOSCR7</name>
          <description>BSEC write once scratch register (0-7)</description>
          <addressOffset>0xf5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WOSDATA</name>
              <description>Write once scratch data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HRCR</name>
          <description>BSEC hot reset count register</description>
          <addressOffset>0xfe8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HRC</name>
              <description>Hot reset counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRCR</name>
          <description>BSEC warm reset count register</description>
          <addressOffset>0xfec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRC</name>
              <description>Warm reset counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
