modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DTS</name>
      <description>DTS Controller</description>
      <groupName>DTS</groupName>
      <baseAddress>0x4600a000</baseAddress>
      <interrupt>
        <name>DTS</name>
        <description>Thermal Sensor interruption</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>PVTREG_LOCKR</name>
          <description>DTS PVT Register Lock Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>PVT software lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTLOCK_SR</name>
          <description>DTS PVT Lock Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW_LOCK_STATUS</name>
              <description>Software lock status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW_LOCK_STATUS</name>
              <description>Hardware lock status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTMR_CR</name>
          <description>DTS PVT Timer Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_DELAY</name>
              <description>Timer delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TMR_RUN</name>
              <description>Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTMR_SR</name>
          <description>DTS PVT Timer Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_BUSY</name>
              <description>Counter busy flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR_DONE</name>
              <description>Cnt delay timeout</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_IER</name>
          <description>DTS PVT IRQ Enable Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_IRQ_ENABLE</name>
              <description>Timer IRQ enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_IRQ_ENABLE</name>
              <description>TS IRQ enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTIRQTRMASKR</name>
          <description>DTS PVT IRQ Timer Mask Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_IRQ_MASK</name>
              <description>Timer IRQ mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_MR</name>
          <description>DTS PVT IRQ TS Mask Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_IRQ_MASK</name>
              <description>TS0 IRQ mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_IRQ_MASK</name>
              <description>TS1 IRQ mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTR_SR</name>
          <description>DTS PVT IRQ Timer Status Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_IRQ_STATUS</name>
              <description>Timer IRQ status after masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_ISR</name>
          <description>DTS PVT IRQ TS Status Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_IRQ_STATUS</name>
              <description>TS0 IRQ status after masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_IRQ_STATUS</name>
              <description>TS1 IRQ status after masking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMA</name>
              <description>TS Alarm A IRQ status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMB</name>
              <description>TS Alarm B IRQ status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTMRRAW_ISR</name>
          <description>DTS PVT IRQ Timer Raw Status Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMR_IRQ_RAW_STATUS</name>
              <description>Timer IRQ status before masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSRAW_ISR</name>
          <description>DTS PVT IRQ TS Raw Status Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_IRQ_RAW_STATUS</name>
              <description>TS0 IRQ status before masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_IRQ_RAW_STATUS</name>
              <description>TS1 IRQ status before masking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCCLKSYNTHR</name>
          <description>DTS TSC Clock Synthesizer Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLK_SYNTH_LO</name>
              <description>Synthesized clk_ts low period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLK_SYNTH_HI</name>
              <description>Synthesized clk_ts ghigh period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLK_SYNTH_HOLD</name>
              <description>Hold input or output delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLK_SYNTH_EN</name>
              <description>Synthesized enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIFDISABLER</name>
          <description>DTS TSC SDIF Interface Disable Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_SDIF_DISABLE</name>
              <description>TS0 SDIF disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_SDIF_DISABLE</name>
              <description>TS1 SDIF disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIF_SR</name>
          <description>DTS TSC SDIF Status Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_BUSY</name>
              <description>SDIF busy flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIF_LOCK</name>
              <description>SDIF locked flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIF_CR</name>
          <description>DTS TSC SDIF Register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_WDATA</name>
              <description>SDIF write data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>SDIF_ADDR</name>
              <description>SDIF register address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SDIF_WRN</name>
              <description>SDIF write no read control</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIF_PROG</name>
              <description>SDIF program request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIFHALTR</name>
          <description>DTS TSC SDIF Halt Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_STOP</name>
              <description>SDIF stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIF_CFGR</name>
          <description>DTS TSC SDIF Control Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_INHIBIT</name>
              <description>SDIF programming inhibit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSMPL_CR</name>
          <description>DTS TSC Sample Control Register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_CTR_DISABLE</name>
              <description>Sample counter disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPL_CTR_HOLD</name>
              <description>Sample counter hold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPL_DISCARD</name>
              <description>Sample discard</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSDIFSMPLCLRR</name>
          <description>DTS TSC Sample Clear Register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_CNTER_CLEAR</name>
              <description>Sample counter clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCSMPLCNTR</name>
          <description>DTS TSC Sample Count Register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_COUNT</name>
              <description>Sample counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_IER0</name>
          <description>DTS TSx IRQ Enable Register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_EN_FAULT</name>
              <description>TS Fault IRQ enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_DONE</name>
              <description>TS Sample done IRQ enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_ALARMA</name>
              <description>TS Alarm A IRQ enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_ALARMB</name>
              <description>TS Alarm B IRQ enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_ISR0</name>
          <description>DTS TSx IRQ Status Register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_IRQ_STATUS</name>
              <description>TS0 IRQ status after masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_IRQ_STATUS</name>
              <description>TS1 IRQ status after masking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMA</name>
              <description>TS Alarm A IRQ status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMB</name>
              <description>TS Alarm B IRQ status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_ICR0</name>
          <description>DTS TSx IRQ Clear Register</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_CLEAR_FAULT</name>
              <description>TS Fault IRQ clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_DONE</name>
              <description>TS Sample done IRQ clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_ALARMA</name>
              <description>TS Alarm A IRQ clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_ALARMB</name>
              <description>TS Alarm B IRQ clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSIRQTESTR0</name>
          <description>DTS TSx IRQ Test Register</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_TEST_FAULT</name>
              <description>TS Fault IRQ test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_DONE</name>
              <description>TS Sample done IRQ test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_ALARMA</name>
              <description>TS Alarm A IRQ test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_ALARMB</name>
              <description>TS Alarm B IRQ test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFRDATAR0</name>
          <description>DTS TSx SDIF RDATA Register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_RDATA</name>
              <description>TS SDIF read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFDONER0</name>
          <description>DTS TSx SDIF Done Register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_SMPL_DONE</name>
              <description>TS Sample done flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFDATAR0</name>
          <description>DTS TSx SDIF Data Register</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLE_DATA</name>
              <description>TS Sample data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SAMPLE_TYPE</name>
              <description>TS Sample type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMPLE_FAULT</name>
              <description>TS Sample fault</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSALARMA_CFGR0</name>
          <description>DTS TSx Alarm A Configuration Register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYSTA_THRESH</name>
              <description>TS Alarm A hysteresis threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ALARMA_THRESH</name>
              <description>TS Alarm A threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSALARMB_CFGR0</name>
          <description>DTS TSx Alarm B Configuration Register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYSTB_THRESH</name>
              <description>TS Alarm B hysteresis threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ALARMB_THRESH</name>
              <description>TS Alarm B threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHLSAMPLER0</name>
          <description>DTS TSx High/Low Sample Register</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_LO</name>
              <description>TS Lowest valid data sample value received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SMPL_HI</name>
              <description>TS Highest valid data sample value received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
