modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>CCIPR7</name>
          <description>RCC clock configuration for independent peripheral register 7</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERSEL</name>
              <description>Source selection for the PER kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC19</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC10</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC15</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC20</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSSISEL</name>
              <description>Source selection for the PSSI kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC20</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>Source selection for the RTC kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <description>RTC OSC clock divider selection (for clock hse_ck)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_36</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_49</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_81</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_100</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_121</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_144</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_169</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_196</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_225</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_289</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_324</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_361</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_400</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_441</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_484</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_529</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_576</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_625</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_676</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_729</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_784</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_841</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_900</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_961</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1024</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1089</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1156</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1225</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1296</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1369</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1444</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1521</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1600</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1681</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1764</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1849</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1936</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2025</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2116</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2209</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2304</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2401</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2500</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2601</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2704</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2809</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2916</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3025</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3136</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3249</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3364</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3481</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3600</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3721</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3844</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3969</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4096</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SEL</name>
              <description>Source selection for the SAI1 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SAI2SEL</name>
              <description>Source selection for the SAI2 kernel clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR8</name>
          <description>RCC clock configuration for independent peripheral register 8</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDMMC1SEL</name>
              <description>Source selection for the SDMMC1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDMMC2SEL</name>
              <description>Source selection for the SDMMC2 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR9</name>
          <description>RCC clock configuration for independent peripheral register 9</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPDIFRX1SEL</name>
              <description>Source selection for the SPDIFRX1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC7</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC8</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1SEL</name>
              <description>Source selection for the SPI1 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI2SEL</name>
              <description>Source selection for the SPI2 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI3SEL</name>
              <description>Source selection for the SPI3 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI4SEL</name>
              <description>Source selection for the SPI4 kernel clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI5SEL</name>
              <description>Source selection for the SPI5 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI6SEL</name>
              <description>Source selection for the SPI6 kernel clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR12</name>
          <description>RCC clock configuration for independent peripheral register 12</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPTIM1SEL</name>
              <description>Source selection for the LPTIM1 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>Source selection for the LPTIM2 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM3SEL</name>
              <description>Source selection for the LPTIM3 kernel clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM4SEL</name>
              <description>Source selection for the LPTIM4 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM5SEL</name>
              <description>Source selection for the LPTIM5 kernel clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR13</name>
          <description>RCC clock configuration for independent peripheral register 13</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>Source selection for the USART1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>USART2SEL</name>
              <description>Source selection for the USART2 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>Source selection for the USART3 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>Source selection for the UART4 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>Source selection for the UART5 kernel clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>USART6SEL</name>
              <description>Source selection for the USART6 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UART7SEL</name>
              <description>Source selection for the UART7 kernel clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UART8SEL</name>
              <description>Source selection for the UART8 kernel clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR14</name>
          <description>RCC clock configuration for independent peripheral register 14</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UART9SEL</name>
              <description>Source selection for the UART9 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>USART10SEL</name>
              <description>Source selection for the USART10 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <description>Source selection for the LPUART1 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK4</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC9</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC14</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
