modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>APB5LPENSR</name>
          <description>RCC APB5 sleep enable register</description>
          <addressOffset>0xabc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LTDCLPENS</name>
              <description>LTDC enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMIPPLPENS</name>
              <description>DCMIPP enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFXTIMLPENS</name>
              <description>GFXTIM enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCLPENS</name>
              <description>VENC enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSILPENS</name>
              <description>CSI enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR0</name>
          <description>RCC oscillator privilege configuration set register 0</description>
          <addressOffset>0xf84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LSIPRIVS</name>
              <description>Privileged protection of the LSI configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEPRIVS</name>
              <description>Privileged protection of LSE configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPRIVS</name>
              <description>Privileged protection of MSI configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIPRIVS</name>
              <description>Privileged protection of HSI configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEPRIVS</name>
              <description>Privileged protection of HSE configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR0</name>
          <description>RCC oscillator public configuration set register 0</description>
          <addressOffset>0xf8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LSIPUBS</name>
              <description>Public protection of LSI configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEPUBS</name>
              <description>Public protection of LSE configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPUBS</name>
              <description>Public protection of MSI configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIPUBS</name>
              <description>Public protection of HSI configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEPUBS</name>
              <description>Public protection of he HSE configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR1</name>
          <description>RCC PLL privilege configuration set register 1</description>
          <addressOffset>0xf94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL1PRIVS</name>
              <description>Privileged protection of PLL1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PRIVS</name>
              <description>Privileged protection of PLL2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PRIVS</name>
              <description>Privileged protection of PLL3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PRIVS</name>
              <description>Privileged protection of PLL4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR1</name>
          <description>RCC PLL public configuration set register 1</description>
          <addressOffset>0xf9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL1PUBS</name>
              <description>Public protection of PLL1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PUBS</name>
              <description>Public protection of PLL2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PUBS</name>
              <description>Public protection of PLL3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PUBS</name>
              <description>Public protection of PLL4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR2</name>
          <description>RCC divider privilege configuration set register 2</description>
          <addressOffset>0xfa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC1PRIVS</name>
              <description>Privileged protection of IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PRIVS</name>
              <description>Privileged protection of IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PRIVS</name>
              <description>Privileged protection of IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PRIVS</name>
              <description>Privileged protection of IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PRIVS</name>
              <description>Privileged protection of IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PRIVS</name>
              <description>Privileged protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PRIVS</name>
              <description>Privileged protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PRIVS</name>
              <description>Privileged protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PRIVS</name>
              <description>Privileged protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PRIVS</name>
              <description>Privileged protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PRIVS</name>
              <description>Privileged protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PRIVS</name>
              <description>Privileged protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PRIVS</name>
              <description>Privileged protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PRIVS</name>
              <description>Privileged protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PRIVS</name>
              <description>Privileged protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PRIVS</name>
              <description>Privileged protection of IC16 configuration bits (enable, ready, divider)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PRIVS</name>
              <description>Privileged protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PRIVS</name>
              <description>Privileged protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PRIVS</name>
              <description>Privileged protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PRIVS</name>
              <description>Privileged protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR2</name>
          <description>RCC divider public configuration set register 2</description>
          <addressOffset>0xfac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC1PUBS</name>
              <description>Public protection of IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUBS</name>
              <description>Public protection of IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUBS</name>
              <description>Public protection of IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUBS</name>
              <description>Public protection of IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUBS</name>
              <description>Public protection of IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUBS</name>
              <description>Public protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUBS</name>
              <description>Public protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUBS</name>
              <description>Public protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUBS</name>
              <description>Public protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUBS</name>
              <description>Public protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUBS</name>
              <description>Public protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUBS</name>
              <description>Public protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUBS</name>
              <description>Public protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUBS</name>
              <description>Public protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUBS</name>
              <description>Public protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUBS</name>
              <description>Public protection of th IC16 configuration bits (enable, ready, divider</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUBS</name>
              <description>Public protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUBS</name>
              <description>Public protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUBS</name>
              <description>Public protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUBS</name>
              <description>Public protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR3</name>
          <description>RCC system privilege configuration set register 3</description>
          <addressOffset>0xfb4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODPRIVS</name>
              <description>Privileged protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPRIVS</name>
              <description>Privileged protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPRIVS</name>
              <description>Privileged protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPRIVS</name>
              <description>Privileged protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPRIVS</name>
              <description>Privileged protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPRIVS</name>
              <description>Privileged protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR3</name>
          <description>RCC system public configuration set register 3</description>
          <addressOffset>0xfbc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODPUBS</name>
              <description>Public protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPUBS</name>
              <description>Public protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPUBS</name>
              <description>Public protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPUBS</name>
              <description>Public protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPUBS</name>
              <description>Public protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPUBS</name>
              <description>Public protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
