modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>APB4LPENCR1</name>
          <description>RCC APB4 sleep enable clear register 1</description>
          <addressOffset>0x12b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HDPLPENC</name>
              <description>HDP enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1LPENC</name>
              <description>LPUART1 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI6LPENC</name>
              <description>SPI6 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4LPENC</name>
              <description>I2C4 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2LPENC</name>
              <description>LPTIM2 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3LPENC</name>
              <description>LPTIM3 enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4LPENC</name>
              <description>LPTIM4 enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM5LPENC</name>
              <description>LPTIM5 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFLPENC</name>
              <description>VREFBUF enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCLPENC</name>
              <description>RTC enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBLPENC</name>
              <description>RTCAPB enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4LPENCR2</name>
          <description>RCC APB4 sleep enable clear register 2</description>
          <addressOffset>0x12b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYSCFGLPENC</name>
              <description>SYSCFG enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSECLPENC</name>
              <description>BSEC enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSLPENC</name>
              <description>DTS enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB5LPENCR</name>
          <description>RCC APB5 sleep enable clear register</description>
          <addressOffset>0x12bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LTDCLPENC</name>
              <description>LTDC sleep enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMIPPLPENC</name>
              <description>DCMIPP sleep enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFXTIMLPENC</name>
              <description>GFXTIM sleep enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCLPENC</name>
              <description>VENC sleep enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSILPENC</name>
              <description>CSI sleep enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR0</name>
          <description>RCC oscillator privilege configuration clear register 0</description>
          <addressOffset>0x1784</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LSIPRIVC</name>
              <description>Privileged protection of LSI configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEPRIVC</name>
              <description>Privileged protection of LSE configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPRIVC</name>
              <description>Privileged protection of MSI configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIPRIVC</name>
              <description>Privileged protection of HSI configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEPRIVC</name>
              <description>Privileged protection of HSE configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR0</name>
          <description>RCC oscillator public configuration clear register 0</description>
          <addressOffset>0x178c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LSIPUBC</name>
              <description>Public protection of LSI configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEPUBC</name>
              <description>Public protection of LSE configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIPUBC</name>
              <description>Public protection of MSI configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIPUBC</name>
              <description>Public protection of HSI configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEPUBC</name>
              <description>Public protection of HSE configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR1</name>
          <description>RCC PLL privilege configuration clear register 1</description>
          <addressOffset>0x1794</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL1PRIVC</name>
              <description>Privileged protection of PLL1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PRIVC</name>
              <description>Privileged protection of PLL2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PRIVC</name>
              <description>Privileged protection of PLL3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PRIVC</name>
              <description>Privileged protection of PLL4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR1</name>
          <description>RCC PLL public configuration clear register 1</description>
          <addressOffset>0x179c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL1PUBC</name>
              <description>Public protection of th PLL1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PUBC</name>
              <description>Public protection of te PLL2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PUBC</name>
              <description>Public protection of PLL3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PUBC</name>
              <description>Public protection of PLL4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR2</name>
          <description>RCC divider privilege configuration clear register 2</description>
          <addressOffset>0x17a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC1PRIVC</name>
              <description>Privileged protection of the IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PRIVC</name>
              <description>Privileged protection of the IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PRIVC</name>
              <description>Privileged protection of the IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PRIVC</name>
              <description>Privileged protection of the IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PRIVC</name>
              <description>Privileged protection of the IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PRIVC</name>
              <description>Privileged protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PRIVC</name>
              <description>Privileged protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PRIVC</name>
              <description>Privileged protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PRIVC</name>
              <description>Privileged protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PRIVC</name>
              <description>Privileged protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PRIVC</name>
              <description>Privileged protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PRIVC</name>
              <description>Privileged protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PRIVC</name>
              <description>Privileged protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PRIVC</name>
              <description>Privileged protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PRIVC</name>
              <description>Privileged protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PRIVC</name>
              <description>Privileged protection of IC16 configuration bits (enable, ready, divider)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PRIVC</name>
              <description>Privileged protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PRIVC</name>
              <description>Privileged protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PRIVC</name>
              <description>Privileged protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PRIVC</name>
              <description>Privileged protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR2</name>
          <description>RCC divider public configuration clear register 2</description>
          <addressOffset>0x17ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC1PUBC</name>
              <description>Public protection of IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUBC</name>
              <description>Public protection of IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUBC</name>
              <description>Public protection of IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUBC</name>
              <description>Public protection of IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUBC</name>
              <description>Public protection of IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUBC</name>
              <description>Public protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUBC</name>
              <description>Public protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUBC</name>
              <description>Public protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUBC</name>
              <description>Public protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUBC</name>
              <description>Public protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUBC</name>
              <description>Public protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUBC</name>
              <description>Public protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUBC</name>
              <description>Public protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUBC</name>
              <description>Public protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUBC</name>
              <description>Public protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUBC</name>
              <description>Public protection of IC16 configuration bits (enable, ready, divider)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUBC</name>
              <description>Public protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUBC</name>
              <description>Public protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUBC</name>
              <description>Public protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUBC</name>
              <description>Public protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
