modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>HUFFENC_DC11</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC12</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC13</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC14</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC15</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC16</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC17</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC_Bank1_R</name>
      <description>Flexible Memory Controller Bank1</description>
      <groupName>FMC_Bank1</groupName>
      <baseAddress>0x48024000</baseAddress>
      <registers>
        <register>
          <name>BCR1</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>Memory bank enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>Address/data multiplexing enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>Memory type</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash access enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>Burst enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>Wait signal polarity bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>Wait timing configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>Write enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>Wait enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>Extended mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>Wait signal during asynchronous transfers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM page size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>Write burst enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSCOUNT</name>
              <description>Chip Select (CS) counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>Byte lane (NBL) setup</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR1</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>Address setup phase duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>Address-hold phase duration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>Data-phase duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>Bus turnaround phase duration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divide ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>Data latency for synchronous memory</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>Access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>Data Hold phase duration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR2</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>Memory bank enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>Address/data multiplexing enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>Memory type</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash access enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>Burst enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>Wait signal polarity bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>Wait timing configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>Write enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>Wait enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>Extended mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>Wait signal during asynchronous transfers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM page size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>Write burst enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSCOUNT</name>
              <description>Chip Select (CS) counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>Byte lane (NBL) setup</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR2</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>Address setup phase duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>Address-hold phase duration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>Data-phase duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>Bus turnaround phase duration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divide ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>Data latency for synchronous memory</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>Access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>Data Hold phase duration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR3</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>Memory bank enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>Address/data multiplexing enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>Memory type</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash access enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>Burst enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>Wait signal polarity bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>Wait timing configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>Write enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>Wait enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>Extended mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>Wait signal during asynchronous transfers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM page size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>Write burst enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSCOUNT</name>
              <description>Chip Select (CS) counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>Byte lane (NBL) setup</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR3</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>Address setup phase duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>Address-hold phase duration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>Data-phase duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>Bus turnaround phase duration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divide ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>Data latency for synchronous memory</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>Access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>Data Hold phase duration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR4</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>Memory bank enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>Address/data multiplexing enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>Memory type</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash access enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>Burst enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>Wait signal polarity bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>Wait timing configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>Write enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>Wait enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>Extended mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>Wait signal during asynchronous transfers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM page size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>Write burst enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSCOUNT</name>
              <description>Chip Select (CS) counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>Byte lane (NBL) setup</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
