modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>LUT470H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1eb4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT471L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1eb8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT471H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ebc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT472L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ec0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT472H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ec4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT473L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ec8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT473H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ecc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT474L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ed0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT474H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ed4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT475L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ed8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT475H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1edc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT476L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ee0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT476H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ee4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT477L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ee8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT477H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1eec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT478L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ef0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT478H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ef4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT479L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ef8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT479H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1efc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT480L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT480H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT481L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT481H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f0c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT482L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT482H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT483L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT483H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT484L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT484H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT485L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT485H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT486L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT486H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1f34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
