modm-ext/data.modm.io/docs/svd/header_stm32n655xx.svd
        <register>
          <name>LUT800H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2904</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT801L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2908</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT801H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x290c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT802L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2910</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT802H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2914</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT803L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2918</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT803H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x291c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT804L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2920</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT804H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2924</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT805L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2928</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT805H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x292c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT806L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2930</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT806H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2934</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT807L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2938</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT807H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x293c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT808L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2940</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT808H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2944</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT809L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2948</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT809H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x294c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT810L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2950</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT810H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2954</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT811L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2958</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT811H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x295c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT812L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2960</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT812H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2964</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT813L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2968</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT813H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x296c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT814L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2970</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT814H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2974</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT815L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2978</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT815H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x297c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT816L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2980</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT816H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2984</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
